books = [
    {
        'author': 'Фёдор Достоевский',
        'title': 'Преступление и наказание',
        'genre': 'Психологическая драма',
        'pages': 574
    },
    {
        'author': 'Лев Толстой',
        'title': 'Война и мир',
        'genre': 'Исторический роман',
        'pages': 1225
    },
    {
        'author': 'Михаил Булгаков',
        'title': 'Мастер и Маргарита',
        'genre': 'Фантастика, сатира',
        'pages': 480
    },
    {
        'author': 'Джордж Оруэлл',
        'title': '1984',
        'genre': 'Антиутопия',
        'pages': 328
    },
    {
        'author': 'Эрих Мария Ремарк',
        'title': 'Три товарища',
        'genre': 'Военная проза',
        'pages': 384
    },
    {
        'author': 'Габриэль Гарсиа Маркес',
        'title': 'Сто лет одиночества',
        'genre': 'Магический реализм',
        'pages': 416
    },
    {
        'author': 'Рэй Брэдбери',
        'title': '451° по Фаренгейту',
        'genre': 'Научная фантастика',
        'pages': 256
    },
    {
        'author': 'Антуан де Сент-Экзюпери',
        'title': 'Маленький принц',
        'genre': 'Философская сказка',
        'pages': 96
    },
    {
        'author': 'Джером Сэлинджер',
        'title': 'Над пропастью во ржи',
        'genre': 'Роман-воспитание',
        'pages': 277
    },
    {
        'author': 'Александр Пушкин',
        'title': 'Евгений Онегин',
        'genre': 'Роман в стихах',
        'pages': 224
    }
]